geosmall/lp_arduino/hardware/STM32/stm32/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification

menu.pnum=Board part number

menu.xserial=Serial interface
menu.usb=USB interface

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method
menu.flash=Flash Memory Size
menu.ram=RAM Size


################################################################################
# Nucleo 64 boards

Nucleo_64.name=Nucleo-64

Nucleo_64.build.vid=0x0483
Nucleo_64.build.pid=0x5711
Nucleo_64.vid.0=0x0483
Nucleo_64.pid.0=0x5711

Nucleo_64.build.core=lp_stm32f4
Nucleo_64.build.board=Nucleo_64
Nucleo_64.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# NUCLEO_F302R8 board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART2 on PA1, PA0)
Nucleo_64.menu.pnum.NUCLEO_F302R8=Nucleo F302R8
Nucleo_64.menu.pnum.NUCLEO_F302R8.node=NODE_F302R8
Nucleo_64.menu.pnum.NUCLEO_F302R8.upload.maximum_size=65536
Nucleo_64.menu.pnum.NUCLEO_F302R8.upload.maximum_data_size=16384
Nucleo_64.menu.pnum.NUCLEO_F302R8.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_F302R8.build.board=NUCLEO_F302R8
Nucleo_64.menu.pnum.NUCLEO_F302R8.build.series=STM32F30x
Nucleo_64.menu.pnum.NUCLEO_F302R8.build.product_line=STM32F302x8
Nucleo_64.menu.pnum.NUCLEO_F302R8.build.variant=NUCLEO_F302R8
Nucleo_64.menu.pnum.NUCLEO_F302R8.build.cmsis_lib_gcc=arm_cortexM4l_math

# NUCLEO_F303RE board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART2 on PA1, PA0)
Nucleo_64.menu.pnum.NUCLEO_F303RE=Nucleo F303RE
Nucleo_64.menu.pnum.NUCLEO_F303RE.node=NODE_F303RE
Nucleo_64.menu.pnum.NUCLEO_F303RE.upload.maximum_size=524288
Nucleo_64.menu.pnum.NUCLEO_F303RE.upload.maximum_data_size=65536
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.board=NUCLEO_F303RE
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.series=STM32F30x
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.product_line=STM32F303xE
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.variant=NUCLEO_F303RE
Nucleo_64.menu.pnum.NUCLEO_F303RE.build.cmsis_lib_gcc=arm_cortexM4l_math

# NUCLEO_F405RG board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART3 on PB10, PB11)
Nucleo_64.menu.pnum.NUCLEO_F405RG=Nucleo F405RG
Nucleo_64.menu.pnum.NUCLEO_F405RG.node="NODE_F405RG,NUCLEO"
Nucleo_64.menu.pnum.NUCLEO_F405RG.upload.maximum_size=1048576
Nucleo_64.menu.pnum.NUCLEO_F405RG.upload.maximum_data_size=196608
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.board=NUCLEO_F405RG
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.series=STM32F4xx
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.product_line=STM32F405xx
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.variant=NUCLEO_F405RG
Nucleo_64.menu.pnum.NUCLEO_F405RG.build.cmsis_lib_gcc=arm_cortexM4l_math

# NUCLEO_F411RE board
# Support: Serial1 (USART1 on PA10, PA9) and Serial2 (USART2 on PC7, PC6)
Nucleo_64.menu.pnum.NUCLEO_F411RE=Nucleo F411RE
Nucleo_64.menu.pnum.NUCLEO_F411RE.node="NODE_F411RE,NUCLEO"
Nucleo_64.menu.pnum.NUCLEO_F411RE.upload.maximum_size=524288
Nucleo_64.menu.pnum.NUCLEO_F411RE.upload.maximum_data_size=131072
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.board=NUCLEO_F411RE
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.series=STM32F4xx
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.product_line=STM32F411xE
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.variant=NUCLEO_F411RE
Nucleo_64.menu.pnum.NUCLEO_F411RE.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
Nucleo_64.menu.upload_method.MassStorage=Mass Storage
Nucleo_64.menu.upload_method.MassStorage.upload.protocol=
Nucleo_64.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Nucleo_64.menu.upload_method.STLink=STLink
Nucleo_64.menu.upload_method.STLink.upload.protocol=STLink
Nucleo_64.menu.upload_method.STLink.upload.tool=stlink_upload

################################################################################
# Generic F1

GenF1.name=Generic STM32F1 series

GenF1.build.vid=0x1EAF
GenF1.build.pid=0x0004
GenF1.vid.0=0x1EAF
GenF1.pid.0=0x0004

GenF1.build.core=fw_stm32f1
GenF1.build.board=GenF1
GenF1.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# BL F103CB CC3D: https://opwiki.readthedocs.io/en/latest/user_manual/cc3d/index.html
GenF1.menu.pnum.BL_F103CB_CC3D=BL F103CB CC3D
GenF1.menu.pnum.BL_F103CB_CC3D.build.core=bl_stm32f1
GenF1.menu.pnum.BL_F103CB_CC3D.upload.maximum_size=131072
GenF1.menu.pnum.BL_F103CB_CC3D.upload.maximum_data_size=20480
GenF1.menu.pnum.BL_F103CB_CC3D.build.mcu=-mthumb -mcpu=cortex-m3 --specs=nano.specs
GenF1.menu.pnum.BL_F103CB_CC3D.build.board=F103CB_CC3D
GenF1.menu.pnum.BL_F103CB_CC3D.build.series=STM32F10x
GenF1.menu.pnum.BL_F103CB_CC3D.build.product_line=STM32F103xB
GenF1.menu.pnum.BL_F103CB_CC3D.build.variant=F103CB_CC3D
GenF1.menu.pnum.BL_F103CB_CC3D.build.ld_memory=link_STM32103CB_CC_Rev1_memory
GenF1.menu.pnum.BL_F103CB_CC3D.build.ld_sections=link_STM32103CB_CC_Rev1_BL_sections
GenF1.menu.pnum.BL_F103CB_CC3D.build.defines=BL_DEFINES.inc
GenF1.menu.pnum.BL_F103CB_CC3D.build.extra_flags=

# FW F103CB CC3D: https://opwiki.readthedocs.io/en/latest/user_manual/cc3d/index.html
GenF1.menu.pnum.FW_F103CB_CC3D=FW F103CB CC3D
GenF1.menu.pnum.FW_F103CB_CC3D.build.core=fw_stm32f1
GenF1.menu.pnum.FW_F103CB_CC3D.upload.maximum_size=131072
GenF1.menu.pnum.FW_F103CB_CC3D.upload.maximum_data_size=20480
GenF1.menu.pnum.FW_F103CB_CC3D.build.mcu=-mthumb -mcpu=cortex-m3 --specs=nano.specs
GenF1.menu.pnum.FW_F103CB_CC3D.build.board=F103CB_CC3D
GenF1.menu.pnum.FW_F103CB_CC3D.build.series=STM32F10x
GenF1.menu.pnum.FW_F103CB_CC3D.build.product_line=STM32F103xB
GenF1.menu.pnum.FW_F103CB_CC3D.build.variant=F103CB_CC3D
GenF1.menu.pnum.FW_F103CB_CC3D.build.ld_memory=link_STM32103CB_CC_Rev1_memory
GenF1.menu.pnum.FW_F103CB_CC3D.build.ld_sections=link_STM32103CB_CC_Rev1_sections
GenF1.menu.pnum.FW_F103CB_CC3D.build.defines=FW_DEFINES.inc
GenF1.menu.pnum.FW_F103CB_CC3D.build.extra_flags=-ffast-math "-I{build.core.path}/flight/pios/common/libraries/FreeRTOS/Source/include" "-I{build.core.path}/flight/pios/common/libraries/FreeRTOS/Source/portable/GCC/ARM_CM3" "-I{build.core.path}/flight/uavobjects/inc" "-I{build.core.path}/flight/uavtalk/inc" "-I{build.core.path}/flight/libraries/math" "-I{build.core.path}/flight/libraries/pid" "-I{build.core.path}/flight/build/firmware/uavobjects" "-I{build.core.path}/flight/modules/Actuator/inc" "-I{build.core.path}/flight/modules/Attitude/inc" "-I{build.core.path}/flight/modules/CameraStab/inc" "-I{build.core.path}/flight/modules/FirmwareIAP/inc"  "-I{build.core.path}/flight/modules/GPS/inc" "-I{build.core.path}/flight/modules/ManualControl/inc" "-I{build.core.path}/flight/modules/Osd/osdoutput/inc" "-I{build.core.path}/flight/modules/Stabilization/inc" "-I{build.core.path}/flight/modules/System/inc" "-I{build.core.path}/flight/modules/Telemetry/inc" "-I{build.core.path}/flight/modules/TxPID/inc" "-I{build.core.path}/flight/libraries/mavlink/v1.0/common"

# FW NO BL F103CB CC3D: https://opwiki.readthedocs.io/en/latest/user_manual/cc3d/index.html
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D=FW NO BL F103CB CC3D
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D.build.core=fw_no_bl_stm32f1
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D.upload.maximum_size=131072
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D.upload.maximum_data_size=20480
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D.build.mcu=-mthumb -mcpu=cortex-m3 --specs=nano.specs
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D.build.board=F103CB_CC3D
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D.build.series=STM32F10x
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D.build.product_line=STM32F103xB
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D.build.variant=F103CB_NO_BL_CC3D
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D.build.ld_memory=link_STM32103CB_CC_Rev1_memory
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D.build.ld_sections=link_STM32103CB_CC_Rev1_sections
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D.build.defines=FW_DEFINES.inc
GenF1.menu.pnum.FW_NOBL_F103CB_CC3D.build.extra_flags=-ffast-math "-I{build.core.path}/flight/pios/common/libraries/FreeRTOS/Source/include" "-I{build.core.path}/flight/pios/common/libraries/FreeRTOS/Source/portable/GCC/ARM_CM3" "-I{build.core.path}/flight/uavobjects/inc" "-I{build.core.path}/flight/uavtalk/inc" "-I{build.core.path}/flight/libraries/math" "-I{build.core.path}/flight/libraries/pid" "-I{build.core.path}/flight/build/firmware/uavobjects" "-I{build.core.path}/flight/modules/Actuator/inc" "-I{build.core.path}/flight/modules/Attitude/inc" "-I{build.core.path}/flight/modules/CameraStab/inc" "-I{build.core.path}/flight/modules/FirmwareIAP/inc"  "-I{build.core.path}/flight/modules/GPS/inc" "-I{build.core.path}/flight/modules/ManualControl/inc" "-I{build.core.path}/flight/modules/Osd/osdoutput/inc" "-I{build.core.path}/flight/modules/Stabilization/inc" "-I{build.core.path}/flight/modules/System/inc" "-I{build.core.path}/flight/modules/Telemetry/inc" "-I{build.core.path}/flight/modules/TxPID/inc" "-I{build.core.path}/flight/libraries/mavlink/v1.0/common"

# Upload menu
GenF1.menu.upload_method.JLink=JLink
GenF1.menu.upload_method.JLink.upload.protocol=JLink
GenF1.menu.upload_method.JLink.upload.tool=jlink_upload

