geosmall/lp_arduino/hardware/STM32/stm32/boards.txt
GenF1.menu.upload_method.STLink=STLink
GenF1.menu.upload_method.STLink.upload.protocol=STLink
GenF1.menu.upload_method.STLink.upload.tool=stlink_upload

GenF1.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF1.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF1.menu.upload_method.bmpMethod.upload.tool=bmp_upload

################################################################################
# Generic F4

GenF4.name=Generic STM32F4 series

GenF4.build.vid=0x1EAF
GenF4.build.pid=0x0004
GenF4.vid.0=0x1EAF
GenF4.pid.0=0x0004

GenF4.build.core=fw_stm32f4
GenF4.build.board=GenF4
GenF4.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# BL F405RG Revo: https://librepilot.atlassian.net/wiki/spaces/LPDOC/pages/26968084/OpenPilot+Revolution
GenF4.menu.pnum.BL_F405RG_revo=BL F405RG Revo
GenF4.menu.pnum.BL_F405RG_revo.build.core=bl_stm32f4
GenF4.menu.pnum.BL_F405RG_revo.upload.maximum_size=1048576
GenF4.menu.pnum.BL_F405RG_revo.upload.maximum_data_size=196608
GenF4.menu.pnum.BL_F405RG_revo.build.mcu=-mthumb -mcpu=cortex-m4 -march=armv7e-m -mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenF4.menu.pnum.BL_F405RG_revo.build.board=F405RG_revo
GenF4.menu.pnum.BL_F405RG_revo.build.series=STM32F4xx
GenF4.menu.pnum.BL_F405RG_revo.build.product_line=STM32F405xx
GenF4.menu.pnum.BL_F405RG_revo.build.variant=F405RG_revo
GenF4.menu.pnum.BL_F405RG_revo.build.ld_memory=link_STM32F4xx_RM_bl_memory
GenF4.menu.pnum.BL_F405RG_revo.build.ld_sections=link_STM32F4xx_RM_sections
GenF4.menu.pnum.BL_F405RG_revo.build.defines=BL_DEFINES.inc
GenF4.menu.pnum.BL_F405RG_revo.build.extra_flags=

# BL F411RE Revo Nano: https://librepilot.atlassian.net/wiki/spaces/LPDOC/pages/26968079/OpenPilot+Revolution+Nano
# Support: Serial1 (USART1 on PA10, PA9)
# Default SPI: SPI (SPI1 on PB3,PB4,PB5)
GenF4.menu.pnum.BL_F411RE_revonano=BL F411RE Revo Nano
GenF4.menu.pnum.BL_F411RE_revonano.build.core=bl_stm32f4
GenF4.menu.pnum.BL_F411RE_revonano.upload.maximum_size=524288
GenF4.menu.pnum.BL_F411RE_revonano.upload.maximum_data_size=131072
GenF4.menu.pnum.BL_F411RE_revonano.build.mcu=-mthumb -mcpu=cortex-m4 -march=armv7e-m -mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenF4.menu.pnum.BL_F411RE_revonano.build.board=F411RE_revonano
GenF4.menu.pnum.BL_F411RE_revonano.build.series=STM32F4xx
GenF4.menu.pnum.BL_F411RE_revonano.build.product_line=STM32F411xE
GenF4.menu.pnum.BL_F411RE_revonano.build.variant=F411RE_revonano
GenF4.menu.pnum.BL_F411RE_revonano.build.ld_memory=link_STM32F4xx_RN_bl_memory
GenF4.menu.pnum.BL_F411RE_revonano.build.ld_sections=link_STM32F4xx_RN_sections
GenF4.menu.pnum.BL_F411RE_revonano.build.defines=BL_DEFINES.inc
GenF4.menu.pnum.BL_F411RE_revonano.build.extra_flags=

# FW F405RG Revo: https://librepilot.atlassian.net/wiki/spaces/LPDOC/pages/26968084/OpenPilot+Revolution
# Support: Serial1 (USART1 on PA10, PA9)
# Default SPI: SPI (SPI1 on PB3,PB4,PB5)
GenF4.menu.pnum.FW_F405RG_revo=FW F405RG Revo
GenF4.menu.pnum.FW_F405RG_revo.build.core=fw_stm32f4
GenF4.menu.pnum.FW_F405RG_revo.upload.maximum_size=1048576
GenF4.menu.pnum.FW_F405RG_revo.upload.maximum_data_size=196608
GenF4.menu.pnum.FW_F405RG_revo.build.mcu=-mthumb -mcpu=cortex-m4 -march=armv7e-m -mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenF4.menu.pnum.FW_F405RG_revo.build.board=F405RG_revo
GenF4.menu.pnum.FW_F405RG_revo.build.series=STM32F4xx
GenF4.menu.pnum.FW_F405RG_revo.build.product_line=STM32F405xx
GenF4.menu.pnum.FW_F405RG_revo.build.variant=F405RG_revo
GenF4.menu.pnum.FW_F405RG_revo.build.ld_memory=link_STM32F4xx_RM_fw_memory
GenF4.menu.pnum.FW_F405RG_revo.build.ld_sections=link_STM32F4xx_RM_sections
GenF4.menu.pnum.FW_F405RG_revo.build.defines=FW_DEFINES.inc
GenF4.menu.pnum.FW_F405RG_revo.build.extra_flags=-ffast-math "-I{build.core.path}/flight/pios/common/libraries/FreeRTOS/Source/include" "-I{build.core.path}/flight/pios/common/libraries/FreeRTOS/Source/portable/GCC/ARM_CM4F" "-I{build.core.path}/flight/pios/common/libraries/msheap" "-I{build.core.path}/flight/uavobjects/inc" "-I{build.core.path}/flight/uavtalk/inc" "-I{build.core.path}/flight/libraries/math" "-I{build.core.path}/flight/libraries/pid" "-I{build.core.path}/flight/libraries/rscode" "-I{build.core.path}/build/firmware/uavobjects" "-I{build.core.path}/flight/modules/Actuator/inc" "-I{build.core.path}/flight/modules/Airspeed/inc" "-I{build.core.path}/flight/modules/Battery/inc" "-I{build.core.path}/flight/modules/CameraStab/inc"  "-I{build.core.path}/flight/modules/FirmwareIAP/inc"  "-I{build.core.path}/flight/modules/GPS/inc"  "-I{build.core.path}/flight/modules/ManualControl/inc"  "-I{build.core.path}/flight/modules/Notify/inc" "-I{build.core.path}/flight/modules/PathFollower/inc" "-I{build.core.path}/flight/modules/PathPlanner/inc" "-I{build.core.path}/flight/modules/Sensors/inc" "-I{build.core.path}/flight/modules/Stabilization/inc" "-I{build.core.path}/flight/modules/StateEstimation/inc" "-I{build.core.path}/flight/modules/System/inc" "-I{build.core.path}/flight/modules/Telemetry/inc" "-I{build.core.path}/flight/modules/TxPID/inc" "-I{build.core.path}/flight/libraries/mavlink/v1.0/common"

# Upload menu
GenF4.menu.upload_method.JLink=JLink
GenF4.menu.upload_method.JLink.upload.protocol=JLink
GenF4.menu.upload_method.JLink.upload.tool=jlink_upload

GenF4.menu.upload_method.STLink=STLink
GenF4.menu.upload_method.STLink.upload.protocol=STLink
GenF4.menu.upload_method.STLink.upload.tool=stlink_upload

GenF4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF4.menu.upload_method.bmpMethod.upload.tool=bmp_upload

################################################################################

# Serialx activation
Nucleo_64.menu.xserial.generic=Enabled with generic Serial
Nucleo_64.menu.xserial.none=Enabled without generic Serial
Nucleo_64.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_64.menu.xserial.disabled=Disabled (No Serial)
Nucleo_64.menu.xserial.disabled.build.xSerial=

GenF1.menu.xserial.generic=Enabled with generic Serial
GenF1.menu.xserial.none=Enabled without generic Serial
GenF1.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF1.menu.xserial.disabled=Disabled (No Serial)
GenF1.menu.xserial.disabled.build.xSerial=

GenF4.menu.xserial.generic=Enabled with generic Serial
GenF4.menu.xserial.none=Enabled without generic Serial
GenF4.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF4.menu.xserial.disabled=Disabled (No Serial)
GenF4.menu.xserial.disabled.build.xSerial=

# USB connectivity
Nucleo_64.menu.usb.none=None
Nucleo_64.menu.usb.HID=HID keyboard and mouse support (if available)
Nucleo_64.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
#Nucleo_64.menu.usb.CDC=CDC (if available)
#Nucleo_64.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DUSE_USB_FS

